HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA0L107.svd
                <register>
                    <name>CTSUSUCLK2</name>
                    <description>CTSU Sensor Unit Clock Control Register B</description>
                    <alternateRegister>CTSUSUCLKB</alternateRegister>
                    <addressOffset>0x0030</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSUCLK3</name>
                    <description>CTSU Sensor Unit Clock Control Register B</description>
                    <alternateRegister>CTSUSUCLKB</alternateRegister>
                    <addressOffset>0x0032</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUOPT</name>
                    <description>CTSU Option Setting Register</description>
                    <addressOffset>0x0040</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>CCOCFEN</name>
                            <description>CCO Characteristics Correction Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CCO characteristics correction function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CCO characteristics correction function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCACEFN</name>
                            <description>Multi-clock Correction Function Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Multi-clock correction function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Multi-clock correction function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MAJIRIMD</name>
                            <description>Majority Mode</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Majority mode is not used</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Majority mode is used</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCLESS</name>
                            <description>Data Transfer Request Disable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data transfer request is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data transfer request is disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MTUCFEN</name>
                            <description>Mutual Capacitance Calculation Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not subtract the first measurement data from the second measurement data</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Subtract the first measurement data from the second measurement data</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJFEN</name>
                            <description>Automatic Judgment Function Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic judgment function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic judgment function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJINTC</name>
                            <description>Automatic Judgment Interrupt Control</description>
                            <lsb>9</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CTSUFN interrupt occurs with touch detection</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CTSUFN interrupt occurs regardless of touch/non-touch detection</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SCACTB</name>
                            <description>Sensor Counter Automatic Correction Table Number Setting</description>
                            <lsb>16</lsb>
                            <msb>19</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUOPTL</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x0040</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAC</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x0040</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>CCOCFEN</name>
                            <description>CCO Characteristics Correction Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CCO characteristics correction function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CCO characteristics correction function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MCACEFN</name>
                            <description>Multi-clock Correction Function Enable</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Multi-clock correction function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Multi-clock correction function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MAJIRIMD</name>
                            <description>Majority Mode</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Majority mode is not used</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Majority mode is used</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>DTCLESS</name>
                            <description>Data Transfer Request Disable</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Data transfer request is enabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Data transfer request is disabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MTUCFEN</name>
                            <description>Mutual Capacitance Calculation Enable</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Do not subtract the first measurement data from the second measurement data</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Subtract the first measurement data from the second measurement data</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJ</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x0041</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>AJFEN</name>
                            <description>Automatic Judgment Function Enable</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Automatic judgment function is disabled</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Automatic judgment function is enabled</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJINTC</name>
                            <description>Automatic Judgment Interrupt Control</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>CTSUFN interrupt occurs with touch detection</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>CTSUFN interrupt occurs regardless of touch/non-touch detection</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUOPTH</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPT</alternateRegister>
                    <addressOffset>0x0042</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUACSB</name>
                    <description>CTSU Option Setting Register</description>
                    <alternateRegister>CTSUOPTH</alternateRegister>
                    <addressOffset>0x0042</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SCACTB</name>
                            <description>Sensor Counter Automatic Correction Table Number Setting</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSCNTACT</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <addressOffset>0x0044</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SCNTACCOEFF</name>
                            <description>Sensor Counter Correction Coefficient Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SCNTACCOUNT</name>
                            <description>Set the measurement value to be compared.</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUSCNTACTL</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUSCNTACT</alternateRegister>
                    <addressOffset>0x0044</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUSCNTACTH</name>
                    <description>CTSU Sensor Counter Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUSCNTACT</alternateRegister>
                    <addressOffset>0x0046</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUMACT1</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x004C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT1L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT1</alternateRegister>
                    <addressOffset>0x004C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
