HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA0L107.svd
                <register>
                    <name>CTSUMACT1H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT1</alternateRegister>
                    <addressOffset>0x004E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUMACT2</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x0050</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT2L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT2</alternateRegister>
                    <addressOffset>0x0050</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUMACT2H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT2</alternateRegister>
                    <addressOffset>0x0052</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUMACT3</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <addressOffset>0x0054</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>SO</name>
                            <description>Sensor offset adjustment bits for multi-clock</description>
                            <lsb>0</lsb>
                            <msb>9</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OFFSETCOEFF</name>
                            <description>Offset coefficient bits for multi-clock</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUMACT3L</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT3</alternateRegister>
                    <addressOffset>0x0054</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUMACT3H</name>
                    <description>CTSU Multi-Clock Automatic Correction Table Access Register</description>
                    <alternateRegister>CTSUMACT3</alternateRegister>
                    <addressOffset>0x0056</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJCR</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <addressOffset>0x0058</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00010000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>TLOT</name>
                            <description>Non-Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>THOT</name>
                            <description>Touch Judgment Criterion Setting</description>
                            <lsb>8</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>BLINI</name>
                            <description>Baseline Initialization</description>
                            <lsb>16</lsb>
                            <msb>16</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Perform baseline operations</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Initialize the results of baseline operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>JC</name>
                            <description>Judgment Condition Setting</description>
                            <lsb>20</lsb>
                            <msb>21</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Judges as touch when there is one or more touch detections</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Judges as touch when there are two or more touch detections</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Judges as touch when there are three or more touch detections</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Judges as touch only when there are four touch detections</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>AJMMAT</name>
                            <description>Measured Value Moving Average Number Setting</description>
                            <lsb>24</lsb>
                            <msb>27</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJBMAT</name>
                            <description>Baseline Average Number Setting</description>
                            <lsb>28</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCRL</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x0058</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJCR0</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x0058</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>TLOT</name>
                            <description>Non-Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCR1</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x0059</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>THOT</name>
                            <description>Touch Judgment Criterion Setting</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCRH</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x005A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0001</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJCR2</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCRH</alternateRegister>
                    <addressOffset>0x005A</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x01</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>BLINI</name>
                            <description>Baseline Initialization</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Perform baseline operations</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Initialize the results of baseline operations</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>JC</name>
                            <description>Judgment Condition Setting</description>
                            <lsb>4</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>Judges as touch when there is one or more touch detections</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>Judges as touch when there are two or more touch detections</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Judges as touch when there are three or more touch detections</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Judges as touch only when there are four touch detections</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJCR3</name>
                    <description>CTSU Automatic Judgment Control Register</description>
                    <alternateRegister>CTSUAJCR</alternateRegister>
                    <addressOffset>0x005B</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>AJMMAT</name>
                            <description>Measured Value Moving Average Number Setting</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJBMAT</name>
                            <description>Baseline Average Number Setting</description>
                            <lsb>4</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJTHR</name>
                    <description>CTSU Automatic Judgment Threshold Register</description>
                    <addressOffset>0x005C</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AJTHL</name>
                            <description>Lower Threshold Setting</description>
                            <lsb>0</lsb>
                            <msb>15</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJTHH</name>
                            <description>Upper Threshold Setting</description>
                            <lsb>16</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJTHRL</name>
                    <description>CTSU Automatic Judgment Threshold Register</description>
                    <alternateRegister>CTSUAJTHR</alternateRegister>
                    <addressOffset>0x005C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJTHRH</name>
                    <description>CTSU Automatic Judgment Threshold Register</description>
                    <alternateRegister>CTSUAJTHR</alternateRegister>
                    <addressOffset>0x005E</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJMMAR</name>
                    <description>CTSU Threshold Register</description>
                    <addressOffset>0x0060</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AJMMATI</name>
                            <description>Moving Average Count</description>
                            <lsb>0</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>AJMMR</name>
                            <description>Moving Average Result</description>
                            <lsb>5</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJMMARL</name>
                    <description>CTSU Threshold Register</description>
                    <alternateRegister>CTSUAJMMAR</alternateRegister>
                    <addressOffset>0x0060</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJMMARH</name>
                    <description>CTSU Threshold Register</description>
                    <alternateRegister>CTSUAJMMAR</alternateRegister>
                    <addressOffset>0x0062</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJBLACT</name>
                    <description>CTSU Baseline Average Intermediate Result Register</description>
                    <addressOffset>0x0064</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xffffffff</resetMask>
                    <fields>
                        <field>
                            <name>AJBLACT</name>
                            <description>Automatic determination baseline average calculation bits</description>
                            <lsb>0</lsb>
                            <msb>31</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTSUAJBLACTL</name>
                    <description>CTSU Baseline Average Intermediate Result Register</description>
                    <alternateRegister>CTSUAJBLACT</alternateRegister>
                    <addressOffset>0x0064</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
                <register>
                    <name>CTSUAJBLACTH</name>
                    <description>CTSU Baseline Average Intermediate Result Register</description>
                    <alternateRegister>CTSUAJBLACT</alternateRegister>
                    <addressOffset>0x0066</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xffff</resetMask>
                </register>
