HungChienSix/Renesas_SourceCode/Renesas.RA_DFP.6.4.0/SVD/R7FA0L107.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>IICA</name>
            <description>Serial Interface IICA</description>
            <baseAddress>0x400A3000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>18</size>
                <usage>registers</usage>
            </addressBlock>
            <addressBlock>
                <offset>0x100</offset>
                <size>20</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>IICA%s</name>
                    <description>IICA Shift Register %s</description>
                    <addressOffset>0x0000</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>IICS%s</name>
                    <description>IICA Status Register %s</description>
                    <addressOffset>0x0001</addressOffset>
                    <size>8</size>
                    <access>read-only</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>SPD</name>
                            <description>Detection of Stop Condition</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Stop condition was not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Stop condition was detected. Communication of the master device is terminated and the bus is released.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STD</name>
                            <description>Detection of Start Condition</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Start condition was not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start condition was detected. This indicates that the address transfer period is in effect.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ACKD</name>
                            <description>Detection of Acknowledge (ACK)</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Acknowledge was not detected.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Acknowledge was detected.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>TRC</name>
                            <description>Detection of Transmit and Receive Status</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Receive status (other than transmit status). The SDAAn line is set for high impedance.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Transmit status. The value in the SOn latch is enabled for output to the SDAAn line (valid starting at the falling edge of the first byte's 9th clock cycle).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COI</name>
                            <description>Detection of Matching Addresses</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Addresses do not match.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Addresses match. Or, the all address match function is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>EXC</name>
                            <description>Detection of Extension Code Reception</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Extension code was not received.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Extension code was received. Or, the all address match function is enabled.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>ALD</name>
                            <description>Detection of Arbitration Loss</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>This status means either that there was no arbitration, or that the arbitration result was a win.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>This status indicates the arbitration result was a loss. The MSTS bit is cleared.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>MSTS</name>
                            <description>Master Status Check Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Slave mode status or communication standby status</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Master mode communication status</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <dim>2</dim>
                    <dimIncrement>0x8</dimIncrement>
                    <dimIndex>0-1</dimIndex>
                    <name>IICF%s</name>
                    <description>IICA Flag Register %s</description>
                    <addressOffset>0x0002</addressOffset>
                    <size>8</size>
                    <access>read-write</access>
                    <resetValue>0x00</resetValue>
                    <resetMask>0xff</resetMask>
                    <fields>
                        <field>
                            <name>IICRSV</name>
                            <description>Communication Reservation Function Disable Bit</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Enable communication reservation</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Disable communication reservation</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STCEN</name>
                            <description>Initial Start Enable Trigger</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>After operation is enabled (IICCTLn0.IICE = 1), enable generation of a start condition upon detection of a stop condition.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>After operation is enabled (IICCTLn0.IICE = 1), enable generation of a start condition without detecting a stop condition.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>IICBSY</name>
                            <description>I2C Bus Status Flag</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Bus release status (communication initial status when STCEN = 1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Bus communication status (communication initial status when STCEN = 0)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>STCF</name>
                            <description>IICCTLn0.STT Clear Flag</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Generate start condition</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Start condition generation unsuccessful: clear the IICCTLn0.STT flag</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
